app/controllers/arcmnu_controller.rb

  def show
    session['chk_mnu_type']=2
    @mtype= 'ADMARC'
    @mn = Menu.find_all_by_mtype(@mtype,:order=>"no")
---
SELECT * FROM `menus` WHERE (`menus`.`mtype` = 'ADMARC') ORDER BY no LIMIT 1