app/controllers/loggs_controller.rb

  def show
    @logs = Loggs.paginate(:all,:per_page=>sysparam('per_page'),
                           :page=>params[:page]||'1',:order=>"created_at desc")
---
SELECT * FROM `loggs` ORDER BY created_at desc LIMIT 0, 50
SELECT count(*) AS count_all FROM `loggs`