app/controllers/main_controller.rb

SELECT * FROM `programs` WHERE (value_date>='2002-01-13' and value_date<='2002-01-13 02:11:42') ORDER BY value_date desc
---
  def view
    @program = Program.find(:all)