app/controllers/menu_controller.rb

SELECT * FROM `menus` WHERE (`menus`.menu_id = 4 AND (mtype!='PRGACT' && 'N'='N' || 'Y'='N')) ORDER BY no
---
  def show
    @mtype= 'ADMNOW'
    par=sysparam('prog_act')
    @mn = Menu.find_by_mtype(@mtype,
      :order=>"no").mlist.find(:all,:conditions=>["mtype!='PRGACT' && 'N'=? || 'Y'=?",par,par])