app/controllers/new_controller.rb

SELECT * FROM `news` WHERE ( value_date>='2002-01-09' and status!='ACT'
SELECT count(*) AS count_all FROM `news` WHERE ( value_date>='2012-03-24' and status!='ACT'
---
  def edlist
    store_location
    @vnews=New.paginate(:all,:per_page=>sysparam('per_page'), :page=>params[:page]||'1',
                             :conditions=>[" value_date>=? and status!='ACT'",Date.today-10])

SELECT * FROM `news` WHERE ( (value_date>='2002-02-01' and menu_id=1 or menu_id!=1)and status in ('NEW','ACT')) ORDER BY menu_id desc,value_date desc,no desc LIMIT 0, 50
SELECT count(*) AS count_all FROM `news` WHERE ( (value_date>='2012-04-03' and menu_id=1 or menu_id!=1)and status in ('NEW','ACT'))
---
  def mkact
    store_location
    @vnews=New.paginate(:all,:page=>params[:page]||'1',:per_page=>sysparam('per_page'),
                             :conditions=>[" value_date>=? or status='NEW'",Date.today],
                             :order=>"value_date desc,no desc ")

SELECT * FROM `news` WHERE ((value_date<'2002-02-01' and menu_id=1 ) and status in ('ACT','NEW') ) ORDER BY value_date desc LIMIT 0, 50
SELECT count(*) AS count_all FROM `news` WHERE ((value_date<'2012-04-26' and menu_id=1 ) and status in ('ACT','NEW') )
---
  def arcnew
    store_location
    @vnews=New.paginate(:all,:page=>params[:page]||'1',:per_page=>sysparam('per_page'),
                             :conditions=>[" value_date<? and status='ACT'",Date.today],:order=>"value_date desc")

SELECT * FROM `news` WHERE (`news`.`id` = 15)
---
  def edit
    @vnew = New.find(params[:id])

SELECT * FROM `news` WHERE (`news`.`id` = 15)
UPDATE `news` SET `descr` = 'Вы слушаете радио Он-лайн.\r\nВы слушаете радио Он-лайн.\r\nВы слушаете радио Он-лайн.\r\n Вы слушаете радио Он-лайн.Вы слушаете радио Он-лайн.Вы слушаете радио Он-лайн.Вы слушаете радио Он-лайн.' WHERE `id` = 40
---
  def update
   unless params[:sel_prog].nil?
     redirect_to :controller=>"program",:action=>"towm",:vd=>(DateTime.now).strftime('%d-%m-%Y'),:id=>params[:id],:select=>"yes"
     return
   end
   unless params[:cancel].nil?
     redirect_to_back_or_default({:controller=>"new",:action=>"show"})
     return
   end
    @vnew = New.find(params[:id])
    unless params[:upload].nil?
     New.cleanup(@vnew.img_url)
     params[:new][:img_url]= New.save_file(params[:upload])

SELECT * FROM `news` WHERE (`news`.`id` = 12)
UPDATE `news` SET `value_date` = '2012-04-03', `status` = 'NEW' WHERE `id` = 82
---
  def updact
    if params[:id2].nil?
     store_location
    end
    unless params[:id2].nil?
     n=New.find(params[:id2])
     n.status=case n.status
      when 'NEW'
       'ACT'
      when 'ACT'
       'NEW'
      end
     if n.value_date<Date.today
      n.value_date=Date.today
     end
     n.save