app/controllers/program_controller.rb

  def clndr
    @begin_of_date=Date.strptime("#{params[:vd]}", "%d-%m-%Y")||Date.today
    if @begin_of_date.month==Date.today.month && @begin_of_date>Date.today-1
      @begin_of_date=Date.today-1
    end
    @arc=Program.find(:all,
    :conditions=>["value_date>= ? and value_date<?",
                  @begin_of_date,@begin_of_date+1])
---
SELECT * FROM `programs` WHERE (value_date>= '2002-01-01' and value_date<= '2002-01-31' and value_date<'2002-02-01')

  def towm
    @begin_of_date=Date.strptime("#{params[:vd]}", "%d-%m-%Y")||Date.today+1
    if @begin_of_date.month==(Date.today+1).month &&@begin_of_date<(Date.today+1)
      @begin_of_date=Date.today+1
    end
    @lst=Program.find(:all,
    :conditions=>["value_date>= ? and value_date<?",
                  @begin_of_date,@begin_of_date+1])
---
SELECT * FROM `programs` WHERE (value_date>= '2002-01-01' and value_date<= '2002-01-31' and value_date>'2002-01-30')

  def edit2
    store_location
    @begin_of_date=Date.strptime("#{params[:vd]}", "%d-%m-%Y")||Date.today+1
    @program=Program.find(:all,
    :conditions=>["value_date>= ? and value_date<?",
                  @begin_of_date,@begin_of_date+1])
---
SELECT * FROM `programs` WHERE (value_date>= '2002-01-15' and value_date<'2002-01-16')

  def new
    begin_of_date=Date.strptime("#{params[:vd]}", "%d-%m-%Y")||Date.today+1
    p=Program.find(:first,:select=>" max(value_date) as vd",
                   :conditions=>["value_date>= ? and value_date<?",
                    begin_of_date,begin_of_date+1])
---
SELECT max(value_date) as vd FROM `programs` WHERE (value_date>= '2002-01-15' and value_date<'2002-01-16') LIMIT 1

  def create
   unless params[:cancel].nil?
     redirect_to_back_or_default({:controller=>"new",:action=>"show"})
     return
   end
    @program = Program.new(params[:program])
    news=@program.news
    news.each  do |new|
     new.value_date=@program.value_date
     new.program_id=0
     new.menu_id=0
     new.no=100
     new.title=@program.title
     new.img_url=""
    end
    @vd="#{@program.value_date.strftime('%d.%m.%Y')}"
    respond_to do |format|
     if @program.save
---
INSERT INTO `news` (`program_id`, `no`, `descr`, `title`, `ntype`, `menu_id`, `img_url`, `value_date`, `status`) VALUES(13, 100, '', 'kl;', 'NEWS', 0, '', '2002-01-15 08:00:00', 'NEW')
INSERT INTO `programs` (`title`, `image_url`, `description`, `value_date`, `status_id`) VALUES('kl;', '', 'kl;', '2002-01-15 08:00:00', 'NEW')

  def mkact
    store_location
    @vprg=Program.paginate(:all,:page=>params[:page]||'1',:per_page=>sysparam('per_page'),
                             :conditions=>[" value_date>=? and value_date<?",Date.today,Date.today+1],
                             :order=>"value_date desc ")
---
SELECT * FROM `programs` WHERE ( value_date>='2002-01-15' and value_date<'2002-01-16') ORDER BY value_date desc LIMIT 0, 50

  def updact
    if params[:id2].nil?
     store_location
    end
    unless params[:id2].nil?
     #
     vprg=Program.find(:all,:conditions=>[" value_date>=? and id!=?",Date.today,params[:id2]])
     vprg.each do |p|
      p.status_id='NEW'
      p.save
     end
     #
     n=Program.find(params[:id2])
     n.status_id=case n.status_id
      when 'NEW'
       'ACT'
      when 'ACT'
       'NEW'
      end
     if n.value_date<DateTime.now && n.status_id=='ACT'
      n.value_date=DateTime.now
     end
     n.save
---
SELECT * FROM `programs` WHERE ( value_date>='2002-01-15' and id!='13')
UPDATE `programs` SET `value_date` = '2002-01-15 20:09:52', `status_id` = 'ACT' WHERE `id` = 13