app/controllers/sessions_controller.rb

  def create
    logout_keeping_session!
    p=params["/session"]
    p[:password]||=nil
    p[:login]||=nil
    user = User.authenticate(p[:login], p[:password])
    if user
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      self.current_user = user
      new_cookie_flag = (p[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
      redirect_back_or_default('/')
      flash[:notice] = "Вы вошли в систему."
    l=Loggs.new
    l.username="#{params['/session'][:login]}"
    remote_ip = client_ip
    l.message="Вы вошли в систему. IP: #{remote_ip}"
    l.event='LOGIN'
    l.created_at=Time.now
---
INSERT INTO `loggs` (`logg_date`, `created_at`, `updated_at`, `username`, `event`, `message`) VALUES('2002-01-19', '2002-01-18 22:55:54', '2002-01-18 22:55:55', 'admin', 'LOGIN', 'Вы вошли в систему. IP: 78.36.196.106')