app/controllers/sysmnu_controller.rb

SELECT * FROM `menus` WHERE (`menus`.`mtype` = 'ADMSYS') ORDER BY no LIMIT 1
---
  def show
    session['chk_mnu_type']=3
    @mtype= 'ADMSYS'
    @mn = Menu.find_all_by_mtype(@mtype,:order=>"no")