app/controllers/xparam_controller.rb

  def edit
    @vprm = Xparam.find_all_by_ptype('SYS')
---
SELECT * FROM `xparams` WHERE (`xparams`.`ptype` = 'SYS')